Repository: ushis/local-repo
Catalog: share/translations/*.po
Languages: de

source: This program helps to manage local repositories. Specify the path to the repository with the first argument. If no option is specified, some repo information will be printed.
de: Dieses Programm hilft beim Verwalten von lokalen Repositorien. Gib den Pfad zum Repositorium mit dem ersten Argument an. Wenn keine Option angegeben ist, werden Informationen zum Repo ausgegeben.

source: %(prog)s path [options]
de: %(prog)s Pfad [Optionen]

source: path
de: Pfad

source: path to the repo or the repo name if set up in your config file '{0}'
de: Pfad zum Repo oder Name des Repos, wenn er in der Konfigurationsdatei '{0}' angegeben ist

source: add a package to the repo - path can point to a local or remote package file, pkgbuild file or pkgbuild tarball - supported protocols are HTTP(S) and FTP
de: Füge ein Paket dem Repo hinzu - Pfad kann auf eine lokale oder entfernte Paketdatei, PKGBUILD Datei oder einen PKGBUILD Tarball zeigen - Unterstützte Protokolle sind HTTP(S) und FTP

source: download, build and add a package from the AUR to the repo
de: Lade ein Paket aus dem AUR herunter, baue es und füge es dem Repo hinzu

source: rebuild specified packages - NOTE: the 'pkgbuild' path must be set up in the config file
de: Baue die angegebenen Pakete neu - NOTIZ: Der 'pkgbuild' Pfad muss in der Konfigurationsdatei angegeben sein.

source: run an integrity check
de: Führe einen Integritätscheck durch

source: clear the cache
de: Leere den Cache

source: the elephant never forgets
de: Der Elefant vergisst niemals

source: force an operation - use this with -a or --add to up-/downgrade a package
de: Erzwinge eine Operation - Sinnvoll zusammen mit -a oder --add für ein Paket Up-/Downgrade

source: use an alternative config file (instead of '{0}')
de: Benutze eine alternative Konfigurationsdatei (statt '{0}')

source: display info for specified packages
de: Zeige informationen für bestimmte Pakete an

source: list all packages from the repo
de: Liste alle Pakete des Repos auf

source: remove packages from the repo
de: Entferne Pakete aus dem Repo

source: restore repo database
de: Stelle Repo Datenbank wieder her

source: find packages
de: Finde Pakete

source: upgrade all packages in the repo, which are available in the AUR
de: Aktualisiere alle Pakete des Repos, die im AUR verfügbar sind

source: upgrade all packages in the repo, which are based on a VCS and available in the AUR
de: Aktualisiere alle Pakete, die auf einem VCS basieren und im AUR verfügbar sind

source: Could not reach the AUR
de: Konnte das AUR nicht erreichen

source: AUR responded with error: {0}
de: AUR antwortete mit Fehler: {0}

source: AUR responded with invalid data
de: AUR antwortete mit ungültigen Daten

source: Could not parse config file: {0}
de: Konnte Konfigurationsdatei nicht lesen: {0}

source: Could not save config file: {0}
de: Konnte Konfigurationsdatei nicht lesen: {0}

source: Execution cancelled by user
de: Abbruch durch Benutzer

source: Loading repo: {0}
de: Lade Repo: {0}

source: This repo has no packages
de: Dieses Repo hat keine Pakete

source: Package does not exist: {0}
de: Paket existiert nicht: {0}

source: Package information: {0}
de: Paket Informationen: {0}

source: No package found
de: Kein Paket gefunden

source: Need following packages as dependencies: [{0}]
de: Benötige folgende Pakete als Abhängigkeiten: [{0}]

source: Install?
de: Installieren?

source: Try without installing dependencies?
de: Versuchen ohne die Abhängigkeiten zu installieren?

source: Bye
de: Tschüß

source: Forging a new package: {0}
de: Schmiede ein neues Paket: {0}

source: Adding package to the repo: {0}
de: Füge Paket dem Repo hinzu: {0}

source: Added Package: {0} {1}
de: Fügte Paket hinzu: {0} {1}

source: Please specify 'pkgbuild' in your config file!
de: Bitte setze die 'pkgbuild' Option in deiner Konfigurationsdatei!

source: Packages do not exist: {0}
de: Pakete existieren nicht: {0}

source: Removing packages: {0}
de: Entferne Pakete: {0}

source: Removed packages: {0}
de: Entfernte Pakete: {0}

source: Retrieving package info from the AUR
de: Hole Paket informationen vom AUR

source: Package is already in the repo: {0}
de: Paket ist bereits im Repo: {0}

source: {0} packages found
de: {0} Pakete gefunden

source: Starting an AUR upgrade
de: Starte AUR Upgrade

source: Nothing to do
de: Es gibt nichts zu tun

source: Checking for updates
de: Prüfe auf Aktualisierungen

source: All packages are up to date
de: Alle Pakete sind aktuell

source: Upgrade?
de: Aktualisieren?

source: Updating all VCS packages
de: Aktualisiere alle VCS Pakete

source: Starting a VCS upgrade
de: Starte VCS Upgrade

source: No VCS packages found
de: Keine VCS Pakete gefunden

source: Clearing the cache
de: Leere den Cache

source: Cleared cache
de: Leerte den Cache

source: Running integrity check
de: Führe Integritätscheck durch

source: No errors found
de: Keine Fehler gefunden

source: Finished integrity check without any errors
de: Beendete Integritätscheck ohne Fehler

source: Finished integrity check with errors:
de: Beendete Integritätscheck mit Fehlern:

source: Restoring database
de: Stelle Datenbank wieder her

source: Restored Database
de: Stellte Datenbank wieder her

source: Could not open log file: {0}
de: Konnte Log Datei nicht öffnen: {0}

source: [Error] {0}
de: [Fehler] {0}

source: Could not store log file: {0} -> {1}
de: Konnte Log Datei nicht ablegen: {0} -> {1}

source: Could not copy PKGBUILD dir: {0} -> {1}
de: Konnte PKGBUILD Verzeichnis nicht kopieren: {0} -> {1}

source: Unresolved dependencies: {0}
de: Unaufgelöste Abhängigkeiten: {0}

source: Could not download file: {0}
de: Konnte Datei nicht herunter laden: {0}

source: Could not open tarball: {0}
de: Konnte Tarball nicht öffnen: {0}

source: Tarball contains bad member: {0}
de: Tarball enthält bösartigen Eintrag: {0}

source: Could not extract tarball: {0}
de: Konnte Tarball nicht auspacken: {0}

source: Could not list directory: {0}
de: Konnte Verzeichnisinhalt nicht lesen: {0}

source: Could not find PKGBUILD: {0}
de: Konnte PKGBUILD nicht finden: {0}

source: Could not find any package: {0}
de: Konnte kein Paket finden: {0}

source: File does not exist: {0}
de: Datei existiert nicht: {0}

source: Could not read package info: {0}
de: Konnte Paket Informationen nicht lesen: {0}

source: An error occurred in tar
de: In tar ist ein Fehler aufgetreten

source: Could not determine package size: {0}
de: Konnte Paketgröße nicht bestimmen: {0}

source: Could not calculate package checksums: {0}
de: Konnte Paket Checksummen nicht berechnen: {0}

source: Invalid file name: {0}
de: Ungültiger Dateiname: {0}

source: Destination is no directory: {0}
de: Ziel ist kein Verzeichnis: {0}

source: File already exists: {0}
de: Datei existiert bereits: {0}

source: Could not move package: {0} -> {1}
de: Konnte Paket nicht verschieben: {0} -> {1}

source: Could not move sig file: {0} -> {1}
de: Konnte Signatur Datei nicht verschieben: {0} -> {1}

source: Could not remove package: {0}
de: Konnte Paket nicht entfernen: {0}

source: An error occurred while running: {0}
de: Ein Fehler trat auf, beim ausführen von: {0}

source: Could not change working directory: {0}
de: Konnte Arbeitsverzeichnis nicht wechseln: {0}

source: Ooh no! Somebody killed the repo elephant
de: Ooh Nein! Jemand hat den Repo Elefanten getötet

source: Could not parse PKGBUILD: {0}
de: Konnte PKGBUILD nicht lesen: {0}

source: Missing PKGBUILD entry: {0}
de: Fehlender PKGBUILD Eintrag: {0}

source: Missing PKGINFO entry: {0}
de: Fehlender PKGINFO Eintrag: {0}

source: Missing fields: {0}
de: Fehlende Felder: {0}

source: Could not add packages to the db: {0}
de: Konnte Pakete nicht zur Datenbank hinzufügen: {0}

source: Could not remove packages from the db: {0}
de: Konnte Pakete nicht aus der Datenbank entfernen: {0}

source: Package has no valid checksum: {0}
de: Paket hat keine gültige Check-Summe: {0}

source: Missing signature for package: {0}
de: Fehlende Signatur für das Paket: {0}

source: Package is not listed in repo database: {0}
de: Paket ist nicht in der Repo Datenbank enthalten: {0}

source: Could not find database: {0}
de: Konnte Datenbank nicht finden: {0}

source: Could not open database: {0}
de: Konnte Datenbank nicht öffnen: {0}

source: Invalid db entry: {0}: {1}
de: Ungültiger Datenbankeintrag: {0}: {1}

source: Could not read db entry: {0}
de: Konnte Datenbankeintrag nicht lesen: {0}

source: Could not close database: {0}
de: Konnte Datenbank nicht schließen: {0}

source: Could not remove database: {0}
de: Konnte Datenbank nicht löschen: {0}

source: Cache is outdated: {0}
de: Cache ist veraltet: {0}

source: Could not load cache: {0}
de: Konnte Cache nicht laden: {0}

source: Could not update cache: {0}
de: Konnte Cache nicht aktualisieren: {0}

source: Could not clear cache: {0}
de: Konnte Cache nicht leeren: {0}

source: [y|N]
de: [j|N]

source: y
de: j

source: yes
de: ja

source: Architecture
de: Architektur

source: Bugs
de: Fehler

source: Build Date
de: Packdatum

source: Package size
de: Paketgröße

source: Description
de: Beschreibung

source: Filename
de: Dateiname

source: Installed size
de: Installierte Größe

source: Last update
de: Letzte Aktualisierung

source: License
de: Lizenz

source: Location
de: Ort

source: MD5sum
de: MD5-Summe

source: Packager
de: Packer

source: Packages
de: Pakete

source: Signed
de: Signiert

source: SHA256sum
de: SHA256-Summe

source: Translations
de: Übersetzungen

source: Website
de: Webseite

source: Yes
de: Ja

source: No
de: Nein

source: usage:
de: Verwendung:

source: positional arguments
de: Argumente

source: optional arguments
de: Optionen

source: show this help message and exit
de: Zeige diese Hilfe und beende

source: too few arguments
de: Zu wenig Argumente

source: unrecognized arguments: %s
de: Ungültige Argumente: %s

source: expected at least one argument
de: Erwarte mindestens ein Argument

source: %(prog)s: error: %(message)s
de: %(prog)s: Fehler: %(message)s
